OpenFOAM-7/tutorials/multiphase/twoLiquidMixingFoam/lockExchange/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.sludge 0
);

regions
(
    boxToCell
    {
        box (0 0 0) (5 2 2);

        fieldValues
        (
            volScalarFieldValue alpha.sludge 1
        );
    }
);

// ************************************************************************* //
